# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 1  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors: 3
# YOLOv5 v6.0 backbone
backbone:
    # [from, number, module, args]
  [
    [-1, 1, Conv, [64, 6, 2, 2]], # 0-P1/2
    [-1, 1, Conv, [128, 3, 2]], # 1-P2/4
    [-1, 1, C3, [128]],
    [-1, 1, Conv, [256, 3, 2]], # 3-P3/8
    [-1, 1, C3, [256]],
    [-1, 1, Conv, [512, 3, 2]], # 5-P4/16
    [-1, 1, C3, [512]],
    [-1, 1, Conv, [1024, 3, 2]], # 7-P5/32-
    [-1, 1, EfficientChannelAttention, [1, 2]],
    [-1, 1, SPPF, [1024, 5]], # 9
  ]
# YOLOv5 v6.0 head
head:
  [[-1, 1, nn.Upsample, [None, 2, 'nearest']], # 10
   [6, 1, Conv, [256, 1, 1, None, 1, 1, False]],
   [[-2, -1], 1, Concat, [1]],
    [-1, 1, RepC3, [256, 0.3]],

   [-1, 1, Conv, [256, 1, 1]], # 14
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #15
   [4, 1, Conv, [256, 1, 1, None, 1, 1, False]],
   [[-2, -1], 1, Concat, [1]],
    [-1, 1, RepC3, [256, 0.3]],  # 18

   [-1, 1, Conv, [256, 3, 2]], # 19
   [[-1, 14], 1, Concat, [1]],
    [-1, 1, RepC3, [512, 0.3]], # 21

   [-1, 1, Conv, [256, 3, 2]], # 22
   [[-1, 9], 1, Concat, [1]],
    [-1, 1, RepC3, [1024, 0.3]], # 24

   [[18, 21, 24], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
   ]